Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                multiple                  1048832   
=================================================================
Total params: 1,048,832
Trainable params: 1,048,832
Non-trainable params: 0
_________________________________________________________________
